#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int a = 20;
//	float b = 10.0;
//	int c = -10;
//	return 0;
//}

//写一个程序，判断机器是大端存储还是小端存储
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//		return 1;
//	else
//		return 0;
//}
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//		return *p;
//}
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;//使用char*的意义是：指针类型决定了指针解引用操作能访问几个字节，char*的指针只能访问一个字节。
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
// 
  
//int main()
//{
//	char a = -128;
////10000000000000000000000010000000——源码
////11111111111111111111111101111111——反码
////11111111111111111111111110000000——补码
////10000000——char a的补码
////11111111111111111111111110000000——char a在打印会整形提升（补码）
////无符号数，源码、反码、补码相同，直接打印
//	printf("%u\n", a);
//	return 0;
//}
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}//死循环
////00000000 00000000 00000000 00001001源码
////00000000 00000000 00000000 00000000再减一
////10000000 00000000 00000000 00000001（-1）
////11111111 11111111 11111111 11111110（-1反码）
////11111111 11111111 11111111 11111111（-1补码）
//#include<string.h>
//int main()
//{
//	char a[1000];//char类型数组最多放-128~127.
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;//-1、-2、-3....-128、127.....1、0.
//	}
//	printf("%d\n", strlen(a));//strlen的停止的条件是‘\0’，ASC||的值是0.
//	return 0;
//}


//理解浮点数的存储规则，
int main()
{
	int n = 9;//00000000000000000000000000001001
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);//%d打印整形，及打印9
	printf("pFloat的值为:%f\n", *pFloat);//将*pFloat该地址00000000000000000000000000001001当成浮点数打印，其中E为全0，及*pFloat=（-1)^0*00000000000000000001001*2^-127=0
	*pFloat = 9.0;//1001
	//(-1)^0*1.001*2^3;
	//0 10000001 00100000000000000000000
	printf("num的值为：%d\n", n);//打印整形，及将0 10000001 00100000000000000000000转化为10进制打印，为1091567616
	printf("pFloat的值为:%f\n", *pFloat);//9.000000
	return 0;
}