#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<string.h>



//理解整形提升的用法，不同字符类所能调用内存的大小。
//int main()
//{
//	unsigned char a = 200;
//	unsigned char b = 100;
//	unsigned char c = 0;
//	c = a + b;//需要进行整形提升
//	//a是无符号数，char类型只有8个bety位。
//	//200是正数，所以他的原反补一样
//	//00000000000000000000000011001000
//	//所以存到a里边存的是11001000；
//	//当a整形提升时，a是无符号数，整形提升直接补0（有符号直接补符号位）
//	//整形提升之后的结果是     00000000000000000000000011001000
//	//同理，b整形提升之后结果是00000000000000000000000001100100
//	//a+b得值                  00000000000000000000000100101100
//	printf("%d  %d", a + b, c);
//	//%d打印十进制位整数，则a+b整数，直接打印
//	//c是无符号字符型，为00101100
//	//打印需整型提升，为00000000000000000000000000101100
//	return 0;
//}


//循环存储
//int main()
//{
//	char arr[1000] = { 0 };
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		arr[i] = -1 - i;
//	}
//	printf("%d\n", strlen(arr));
//	return 0;
//}

//杨辉三角
//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j < 10; j++)
//		{
//			if (j == 0)
//			{
//				arr[i][j] = 1;//补全数组内容
//			}
//			if (i == j)
//			{
//				arr[i][j] = 1;//补全数组内容
//			}
//			if (i >= 1 && j >= 1)
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];//这一行等于上一行相邻两元素之和。
//			}
//		}
//	}
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j < 10 - i; j++)
//		{
//			printf("  ");//补全空格
//		}
//		for (j = 0; j <= i; j++)
//		{
//			printf("%-3d ", arr[i][j]);//打印数组，并对齐
//		}
//		printf("\n");
//	}
//	return 0;
//}

//日本发生了一起谋杀案，警察通过排查确定杀人凶手是4个嫌疑人中的一个

//以下为4个嫌疑人的供词。
//A说：不是我
//B说：是C
//C说：是D
//D说：C在说谎
//已知其中三个人说了实话，一个人说了假话
//现在请根据这些信息，写一个程序来确定凶手是谁

//int main()
//{
//	int killer = 0;
//	for (killer = 'a'; killer <= 'd'; killer++)
//	{
//		if ((killer != "a") + (killer == 'c') + (killer == 'd' + killer != 'd') == 3)//为真则为一，为假则为0
//			//该判断当三个人说真话，一个人说假话的时候，killer的情况。
//		{
//			printf("killer = %c\n", killer);
//		}
//	}
//	return 0;
//}


//赛马问题
//36匹马，6个跑道，没有计时器，请问最少跑几次能确定这匹马速度前三的是那几匹马

//思路是，分六组，//六次
//然后让六祖里的第一去比，第七次
//然后然第七场低一名那组里的第1.2.3名，与第二名那组里的第1 .2，已及第三名去比。第八次

//赛马问题2
//25匹马，5个跑道，没有计时器，请问最少跑几次能确定这匹马速度前三的是那几匹马

//思路是，分5组，//5次
//然后让5组比赛里的第一去比，第6次
//然后然第七场低一名那组里的第2.3名，与第二名那组里的第1 .2，已及第三名去比。第7次

//烧香问题
//有一种香，材质不均匀，但每根这样的香都正好烧1个小时烧完
//给你两根这样的香，确定15分钟这样的时间段

//思路，第一根香两端同时电着，同时将第二根香从一端点燃。
//当第一根香烧尽时，正好过去半个小时。
//将第二根香燃烧时间还剩余30分钟/
//将第二根香从两端同时点燃。
//第二根香再烧尽的时间就是15分钟

//5位运动员参加比赛，有人让他们预测比赛结果，
//A说：B第一，我第三。
//B说：我第二，E第四
//C说：我第一，D第二
//D说：C最后，我第三
//E说：我第四，A第一
//比赛结束，每位选手都说对了一半。

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (((a == 3) + (b == 3) == 1) &&
//							((a == 3) + (b == 3) == 1) &&
//							((c == 1) + (d == 2) == 1) &&
//							((c == 5) + (d == 3) == 1) &&
//							((e == 4) + (a == 1) == 1))
//						{
//							if (a * b * c * d * e == 120)
//							{
//								printf("a=%d, b=%d,  c=%d, d=%d, e=%d\n", a, b, c, d, e);
//							}
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}


